# language: ru

Функциональность: Пример, хранить тестовые данные в гит репозитории - это нормальная практика? Как обычно принято делать?

Сценарий: Пример, хранить тестовые данные в гит репозитории - это нормальная практика? Как обычно принято делать?


// Молчание "best practices": тестовые и эталонные данные, структура и связность, падения и новая функциональность
// и другие неудобные вопросы к сценарному тестированию
// https://infostart.ru/1c/articles/1243144
// Дмитрий Решитко (транскрипт доклада с INFOSTART EVENT 2019)

// «Подготовка данных»
// https://stepa86.github.io/About-tests-in-1C/BDD/best_practices/02_data_preparation
// Антон Степанов (раздел проекта «Материалы по тестированию в 1С»)

// Раздел «Базы данных»
// https://tester.help/implementation/#_2
// документации инструмента «Тестер» Дмитрия Решитко

// Раздел «Тестовые данные»
// https://bia-technologies.github.io/yaxunit/docs/features/test-data/)
// документации YAxUnit